from flask import Flask
import requests
from flask import render_template
import random
import json
import os

app = Flask(__name__, static_url_path='/static/')

@app.route('/')
def hello_world():
    items = {
        "آلاء": ["آلاق"],
        "أب": ["عب"],
        "أبو سمبل": [
            "عبو سمبل",
            "أبو ثمبل",
            "أبو زمبل",
            "أبو صمبل"
        ],
        "أبيض": [
            "عبيض",
            "أبيد"
        ],
        "أجوبة": ["عجوبة"],
        "أخضر": [
            "عخضر",
            "أغضر",
            "أخدر"
        ],
        "أذربيجان": [
            "عذربيجان",
            "أظربيجان",
            "أزربيجان"
        ],
        "أربعة واربعين": [
            "عربعة واربعين",
            "أربأة واربعين",
            "أربحة واربعين",
            "أربعة واربأين",
            "أربعة واربحين"
        ],
        "أربعة وتلاتين": [
            "عربعة وتلاتين",
            "أربأة وتلاتين",
            "أربحة وتلاتين",
            "أربعة وطلاتين",
            "أربعة وتلاطين"
        ],
        "أربعة وتمانين": [
            "عربعة وتمانين",
            "أربأة وتمانين",
            "أربحة وتمانين",
            "أربعة وطمانين"
        ],
        "أربعة وسبعين": [
            "عربعة وسبعين",
            "أربأة وسبعين",
            "أربحة وسبعين",
            "أربعة وثبعين",
            "أربعة وزبعين",
            "أربعة وصبعين",
            "أربعة وسبأين",
            "أربعة وسبحين"
        ],
        "أربعة وستين": [
            "عربعة وستين",
            "أربأة وستين",
            "أربحة وستين",
            "أربعة وثتين",
            "أربعة وزتين",
            "أربعة وصتين",
            "أربعة وسطين"
        ],
        "أربعة": [
            "عربعة",
            "أربأة",
            "أربحة"
        ],
        "أربعتاشر": [
            "عربعتاشر",
            "أربأتاشر",
            "أربحتاشر",
            "أربعطاشر"
        ],
        "أربعين": [
            "عربعين",
            "أربأين",
            "أربحين"
        ],
        "أسوان": [
            "عسوان",
            "أثوان",
            "أزوان",
            "أصوان"
        ],
        "أسود": [
            "عسود",
            "أثود",
            "أزود",
            "أصود",
            "أسوض"
        ],
        "أشوفك بعدين": [
            "عشوفك بعدين",
            "أشوفق بعدين",
            "أشوفك بأدين",
            "أشوفك بحدين",
            "أشوفك بعضين"
        ],
        "أفغانستان": [
            "عفغانستان",
            "أفخانستان",
            "أفغانثتان",
            "أفغانزتان",
            "أفغانصتان",
            "أفغانسطان"
        ],
        "ألف": ["علف"],
        "ألمانيا": [
            "علمانيا"
        ],
        "أم كلثوم": [
            "عم كلثوم",
            "أم قلثوم",
            "أم كلسوم",
            "أم كلصوم"
        ],
        "أنا بحبك": [
            "عنا بحبك",
            "أنا بهبك",
            "أنا بعبك",
            "أنا بحبق"
        ],
        "أنا بدردش": [
            "عنا بدردش",
            "أنا بضردش",
            "أنا بدرضش"
        ],
        "أنا ما عنديش": [
            "عنا ما عنديش",
            "أنا ما أنديش",
            "أنا ما حنديش",
            "أنا ما عنضيش"
        ],
        "أنا متشكر قوي": [
            "عنا متشكر قوي",
            "أنا مطشكر قوي",
            "أنا متشقر قوي",
            "أنا متشكر كوي",
            "أنا متشكر ءوي"
        ],
        "أنا مش فاهم": [
            "عنا مش فاهم",
            "أنا مش فاحم"
        ],
        "أنا مش فاهمة": [
            "عنا مش فاهمة",
            "أنا مش فاحمة"
        ],
        "أنا وأخويا على ابن عمي، وأنا وابن عمي على الغريب": [
            "عنا وأخويا على ابن عمي، وأنا وابن عمي على الغريب",
            "أنا وعخويا على ابن عمي، وأنا وابن عمي على الغريب",
            "أنا وأغويا على ابن عمي، وأنا وابن عمي على الغريب",
            "أنا وأخويا ألى ابن عمي، وأنا وابن عمي على الغريب",
            "أنا وأخويا حلى ابن عمي، وأنا وابن عمي على الغريب",
            "أنا وأخويا على ابن أمي، وأنا وابن عمي على الغريب",
            "أنا وأخويا على ابن حمي، وأنا وابن عمي على الغريب",
            "أنا وأخويا على ابن عمي، وعنا وابن عمي على الغريب",
            "أنا وأخويا على ابن عمي، وأنا وابن أمي على الغريب",
            "أنا وأخويا على ابن عمي، وأنا وابن حمي على الغريب",
            "أنا وأخويا على ابن عمي، وأنا وابن عمي ألى الغريب",
            "أنا وأخويا على ابن عمي، وأنا وابن عمي حلى الغريب",
            "أنا وأخويا على ابن عمي، وأنا وابن عمي على الخريب"
        ],
        "أنا": ["عنا"],
        "أهلا وسهلا": [
            "عهلا وسهلا",
            "أحلا وسهلا",
            "أهلا وثهلا",
            "أهلا وزهلا",
            "أهلا وصهلا",
            "أهلا وسحلا"
        ],
        "أوضة": [
            "عوضة",
            "أودة"
        ],
        "أي خدمة": [
            "عي خدمة",
            "أي غدمة",
            "أي خضمة"
        ],
        "أُجَر": ["عُجَر"],
        "إزازة": [
            "إذازة",
            "إظازة",
            "إسازة",
            "إزاذة",
            "إزاظة",
            "إزاسة"
        ],
        "إيجاد الحَل": [
            "إيجاض الحَل",
            "إيجاد الهَل",
            "إيجاد العَل"
        ],
        "اتنين واربعين": [
            "اطنين واربعين",
            "اتنين واربأين",
            "اتنين واربحين"
        ],
        "اتنين وتسعين": [
            "اطنين وتسعين",
            "اتنين وطسعين",
            "اتنين وتثعين",
            "اتنين وتزعين",
            "اتنين وتصعين",
            "اتنين وتسأين",
            "اتنين وتسحين"
        ],
        "اتنين وتلاتين": [
            "اطنين وتلاتين",
            "اتنين وطلاتين",
            "اتنين وتلاطين"
        ],
        "اتنين وتمانين": [
            "اطنين وتمانين",
            "اتنين وطمانين"
        ],
        "اتنين وخمسين": [
            "اطنين وخمسين",
            "اتنين وغمسين",
            "اتنين وخمثين",
            "اتنين وخمزين",
            "اتنين وخمصين"
        ],
        "اتنين وسبعين": [
            "اطنين وسبعين",
            "اتنين وثبعين",
            "اتنين وزبعين",
            "اتنين وصبعين",
            "اتنين وسبأين",
            "اتنين وسبحين"
        ],
        "اتنين وستين": [
            "اطنين وستين",
            "اتنين وثتين",
            "اتنين وزتين",
            "اتنين وصتين",
            "اتنين وسطين"
        ],
        "اتنين وعشرين": [
            "اطنين وعشرين",
            "اتنين وأشرين",
            "اتنين وحشرين"
        ],
        "اتنين": ["اطنين"],
        "اخص": [
            "اغص",
            "اخث",
            "اخس"
        ],
        "ازاي": [
            "اذاي",
            "اظاي",
            "اساي"
        ],
        "ازيك يا محمود، عامل ايه النهاردة؟": [
            "اذيك يا محمود، عامل ايه النهاردة؟",
            "اظيك يا محمود، عامل ايه النهاردة؟",
            "اسيك يا محمود، عامل ايه النهاردة؟",
            "ازيق يا محمود، عامل ايه النهاردة؟",
            "ازيك يا مهمود، عامل ايه النهاردة؟",
            "ازيك يا معمود، عامل ايه النهاردة؟",
            "ازيك يا محموض، عامل ايه النهاردة؟",
            "ازيك يا محمود، أامل ايه النهاردة؟",
            "ازيك يا محمود، حامل ايه النهاردة؟",
            "ازيك يا محمود، عامل ايح النهاردة؟",
            "ازيك يا محمود، عامل ايه النحاردة؟",
            "ازيك يا محمود، عامل ايه النهارضة؟"
        ],
        "ازيك": [
            "اذيك",
            "اظيك",
            "اسيك",
            "ازيق"
        ],
        "اسقف": [
            "اثقف",
            "ازقف",
            "اصقف",
            "اسكف",
            "اسءف"
        ],
        "اسكندراني": [
            "اثكندراني",
            "ازكندراني",
            "اصكندراني",
            "اسقندراني",
            "اسكنضراني"
        ],
        "الأردن": [
            "العردن",
            "الأرضن"
        ],
        "الأسبوع إللي جاي": [
            "العسبوع إللي جاي",
            "الأثبوع إللي جاي",
            "الأزبوع إللي جاي",
            "الأصبوع إللي جاي",
            "الأسبوأ إللي جاي",
            "الأسبوح إللي جاي"
        ],
        "الأقصر": [
            "العقصر",
            "الأكصر",
            "الأءصر",
            "الأقثر",
            "الأقسر"
        ],
        "الاسكندرية": [
            "الاثكندرية",
            "الازكندرية",
            "الاصكندرية",
            "الاسقندرية",
            "الاسكنضرية"
        ],
        "الجزائر": [
            "الجذائر",
            "الجظائر",
            "الجسائر"
        ],
        "الجزّار": [
            "الجذّار",
            "الجظّار",
            "الجسّار"
        ],
        "الحمد لله": [
            "الهمد لله",
            "العمد لله",
            "الحمض لله",
            "الحمد للح"
        ],
        "السعودية": [
            "الثعودية",
            "الزعودية",
            "الصعودية",
            "السأودية",
            "السحودية",
            "السعوضية"
        ],
        "الشغل": ["الشخل"],
        "العراق": [
            "الأراق",
            "الحراق",
            "العراك",
            "العراء"
        ],
        "العربية": [
            "الأربية",
            "الحربية"
        ],
        "القاهرة": [
            "الكاهرة",
            "الءاهرة",
            "القاحرة"
        ],
        "القرد في عين أمه غزال": [
            "الكرد في عين أمه غزال",
            "الءرد في عين أمه غزال",
            "القرض في عين أمه غزال",
            "القرد في أين أمه غزال",
            "القرد في حين أمه غزال",
            "القرد في عين عمه غزال",
            "القرد في عين أمح غزال",
            "القرد في عين أمه خزال",
            "القرد في عين أمه غذال",
            "القرد في عين أمه غظال",
            "القرد في عين أمه غسال"
        ],
        "الكويت": [
            "القويت",
            "الكويط"
        ],
        "اللغة العربية": [
            "اللخة العربية",
            "اللغة الأربية",
            "اللغة الحربية"
        ],
        "الله يخليك": [
            "اللح يخليك",
            "الله يغليك",
            "الله يخليق"
        ],
        "الله يرحمه": [
            "اللح يرحمه",
            "الله يرهمه",
            "الله يرعمه",
            "الله يرحمح"
        ],
        "الله يسلمك": [
            "اللح يسلمك",
            "الله يثلمك",
            "الله يزلمك",
            "الله يصلمك",
            "الله يسلمق"
        ],
        "المغرب": [
            "المخرب"
        ],
        "المملكة المتحدة": [
            "المملقة المتحدة",
            "المملكة المطحدة",
            "المملكة المتهدة",
            "المملكة المتعدة",
            "المملكة المتحضة"
        ],
        "النمسا": [
            "النمثا",
            "النمزا",
            "النمصا"
        ],
        "الهند": [
            "الحند",
            "الهنض"
        ],
        "الولايات المتحدة": [
            "الولاياط المتحدة",
            "الولايات المطحدة",
            "الولايات المتهدة",
            "الولايات المتعدة",
            "الولايات المتحضة"
        ],
        "انت مالك": [
            "انط مالك",
            "انت مالق"
        ],
        "انت منين": [
            "انط منين"
        ],
        "انت": ["انط"],
        "ايه ده": [
            "ايح ده",
            "ايه ضه",
            "ايه دح"
        ],
        "ايه": ["ايح"],
        "باكستان": [
            "باقستان",
            "باكثتان",
            "باكزتان",
            "باكصتان",
            "باكسطان"
        ],
        "بتعمل ايه؟": [
            "بطعمل ايه؟",
            "بتأمل ايه؟",
            "بتحمل ايه؟",
            "بتعمل ايح؟"
        ],
        "بحبك (بحبَك)": [
            "بهبك (بحبَك)",
            "بعبك (بحبَك)",
            "بحبق (بحبَك)",
            "بحبك (بهبَك)",
            "بحبك (بعبَك)",
            "بحبك (بحبَق)"
        ],
        "بحبك (بحبِك)": [
            "بهبك (بحبِك)",
            "بعبك (بحبِك)",
            "بحبق (بحبِك)",
            "بحبك (بهبِك)",
            "بحبك (بعبِك)",
            "بحبك (بحبِق)"
        ],
        "بحر": ["بهر", "بعر"],
        "برتقال": [
            "برطقال",
            "برتكال",
            "برتءال"
        ],
        "برص": ["برث", "برس"],
        "بسكلتة": [
            "بثكلتة",
            "بزكلتة",
            "بصكلتة",
            "بسقلتة",
            "بسكلطة"
        ],
        "بسم الله الرحمن الرحيم": [
            "بثم الله الرحمن الرحيم",
            "بزم الله الرحمن الرحيم",
            "بصم الله الرحمن الرحيم",
            "بسم اللح الرحمن الرحيم",
            "بسم الله الرهمن الرحيم",
            "بسم الله الرعمن الرحيم",
            "بسم الله الرحمن الرهيم",
            "بسم الله الرحمن الرعيم"
        ],
        "بطاقة": [
            "بتاقة",
            "بطاكة",
            "بطاءة"
        ],
        "بطيخ": [
            "بتيخ",
            "بطيغ"
        ],
        "بعد": [
            "بأد",
            "بحد",
            "بعض"
        ],
        "بعدين": [
            "بأدين",
            "بحدين",
            "بعضين"
        ],
        "بقالي": [
            "بكالي",
            "بءالي"
        ],
        "بنت": ["بنط"],
        "بيت": ["بيط"],
        "بيض": ["بيد"],
        "بيلطّفوا": [
            "بيلتّفوا"
        ],
        "تحت": [
            "طحت",
            "تهت",
            "تعت",
            "تحط"
        ],
        "ترب": ["طرب"],
        "تسعة واربعين": [
            "طسعة واربعين",
            "تثعة واربعين",
            "تزعة واربعين",
            "تصعة واربعين",
            "تسأة واربعين",
            "تسحة واربعين",
            "تسعة واربأين",
            "تسعة واربحين"
        ],
        "تسعة وتسعين": [
            "طسعة وتسعين",
            "تثعة وتسعين",
            "تزعة وتسعين",
            "تصعة وتسعين",
            "تسأة وتسعين",
            "تسحة وتسعين",
            "تسعة وطسعين",
            "تسعة وتثعين",
            "تسعة وتزعين",
            "تسعة وتصعين",
            "تسعة وتسأين",
            "تسعة وتسحين"
        ],
        "تسعة وتلاتين": [
            "طسعة وتلاتين",
            "تثعة وتلاتين",
            "تزعة وتلاتين",
            "تصعة وتلاتين",
            "تسأة وتلاتين",
            "تسحة وتلاتين",
            "تسعة وطلاتين",
            "تسعة وتلاطين"
        ],
        "تسعة وتمانين": [
            "طسعة وتمانين",
            "تثعة وتمانين",
            "تزعة وتمانين",
            "تصعة وتمانين",
            "تسأة وتمانين",
            "تسحة وتمانين",
            "تسعة وطمانين"
        ],
        "تسعة وخمسين": [
            "طسعة وخمسين",
            "تثعة وخمسين",
            "تزعة وخمسين",
            "تصعة وخمسين",
            "تسأة وخمسين",
            "تسحة وخمسين",
            "تسعة وغمسين",
            "تسعة وخمثين",
            "تسعة وخمزين",
            "تسعة وخمصين"
        ],
        "تسعة وستين": [
            "طسعة وستين",
            "تثعة وستين",
            "تزعة وستين",
            "تصعة وستين",
            "تسأة وستين",
            "تسحة وستين",
            "تسعة وثتين",
            "تسعة وزتين",
            "تسعة وصتين",
            "تسعة وسطين"
        ],
        "تسعة وعشرين": [
            "طسعة وعشرين",
            "تثعة وعشرين",
            "تزعة وعشرين",
            "تصعة وعشرين",
            "تسأة وعشرين",
            "تسحة وعشرين",
            "تسعة وأشرين",
            "تسعة وحشرين"
        ],
        "تسعة": [
            "طسعة",
            "تثعة",
            "تزعة",
            "تصعة",
            "تسأة",
            "تسحة"
        ],
        "تسعتاشر": [
            "طسعتاشر",
            "تثعتاشر",
            "تزعتاشر",
            "تصعتاشر",
            "تسأتاشر",
            "تسحتاشر",
            "تسعطاشر"
        ],
        "تسعين": [
            "طسعين",
            "تثعين",
            "تزعين",
            "تصعين",
            "تسأين",
            "تسحين"
        ],
        "تشربي": ["طشربي"],
        "تصبح على خير": [
            "طصبح على خير",
            "تثبح على خير",
            "تسبح على خير",
            "تصبه على خير",
            "تصبع على خير",
            "تصبح ألى خير",
            "تصبح حلى خير",
            "تصبح على غير"
        ],
        "تصبحي على خير": [
            "طصبحي على خير",
            "تثبحي على خير",
            "تسبحي على خير",
            "تصبهي على خير",
            "تصبعي على خير",
            "تصبحي ألى خير",
            "تصبحي حلى خير",
            "تصبحي على غير"
        ],
        "تفاح": [
            "طفاح",
            "تفاه",
            "تفاع"
        ],
        "تقسيط": [
            "طقسيط",
            "تكسيط",
            "تءسيط",
            "تقثيط",
            "تقزيط",
            "تقصيط",
            "تقسيت"
        ],
        "تلاتاشر": [
            "طلاتاشر",
            "تلاطاشر"
        ],
        "تلاتة واربعين": [
            "طلاتة واربعين",
            "تلاطة واربعين",
            "تلاتة واربأين",
            "تلاتة واربحين"
        ],
        "تلاتة وتسعين": [
            "طلاتة وتسعين",
            "تلاطة وتسعين",
            "تلاتة وطسعين",
            "تلاتة وتثعين",
            "تلاتة وتزعين",
            "تلاتة وتصعين",
            "تلاتة وتسأين",
            "تلاتة وتسحين"
        ],
        "تلاتة وتمانين": [
            "طلاتة وتمانين",
            "تلاطة وتمانين",
            "تلاتة وطمانين"
        ],
        "تلاتة وسبعين": [
            "طلاتة وسبعين",
            "تلاطة وسبعين",
            "تلاتة وثبعين",
            "تلاتة وزبعين",
            "تلاتة وصبعين",
            "تلاتة وسبأين",
            "تلاتة وسبحين"
        ],
        "تلاتة وعشرين": [
            "طلاتة وعشرين",
            "تلاطة وعشرين",
            "تلاتة وأشرين",
            "تلاتة وحشرين"
        ],
        "تلاتة": [
            "طلاتة",
            "تلاطة"
        ],
        "تلاتين": [
            "طلاتين",
            "تلاطين"
        ],
        "تلتمية": [
            "طلتمية",
            "تلطمية"
        ],
        "تمام": ["طمام"],
        "تمانية وتسعين": [
            "طمانية وتسعين",
            "تمانية وطسعين",
            "تمانية وتثعين",
            "تمانية وتزعين",
            "تمانية وتصعين",
            "تمانية وتسأين",
            "تمانية وتسحين"
        ],
        "تمانية وتلاتين": [
            "طمانية وتلاتين",
            "تمانية وطلاتين",
            "تمانية وتلاطين"
        ],
        "تمانية وتمانين": [
            "طمانية وتمانين",
            "تمانية وطمانين"
        ],
        "تمانية وخمسين": [
            "طمانية وخمسين",
            "تمانية وغمسين",
            "تمانية وخمثين",
            "تمانية وخمزين",
            "تمانية وخمصين"
        ],
        "تمانية وعشرين": [
            "طمانية وعشرين",
            "تمانية وأشرين",
            "تمانية وحشرين"
        ],
        "تمانية": [
            "طمانية"
        ],
        "تمانين": [
            "طمانين"
        ],
        "تمر": ["طمر"],
        "تمساح": [
            "طمساح",
            "تمثاح",
            "تمزاح",
            "تمصاح",
            "تمساه",
            "تمساع"
        ],
        "تمنتاشر": [
            "طمنتاشر",
            "تمنطاشر"
        ],
        "توأم": [
            "طوأم",
            "توعم"
        ],
        "توم": ["طوم"],
        "تونس": [
            "طونس",
            "تونث",
            "تونز",
            "تونص"
        ],
        "ثور": ["سور", "صور"],
        "ثوم": ["سوم", "صوم"],
        "جامد": ["جامض"],
        "جامع": [
            "جامأ",
            "جامح"
        ],
        "جامعة": [
            "جامأة",
            "جامحة"
        ],
        "جدة": ["جضة"],
        "جرح": ["جره", "جرع"],
        "جزر القمر": [
            "جذر القمر",
            "جظر القمر",
            "جسر القمر",
            "جزر الكمر",
            "جزر الءمر"
        ],
        "جسر": [
            "جثر",
            "جزر",
            "جصر"
        ],
        "جمال عبد الناصر": [
            "جمال أبد الناصر",
            "جمال حبد الناصر",
            "جمال عبض الناصر",
            "جمال عبد الناثر",
            "جمال عبد الناسر"
        ],
        "جمعة": [
            "جمأة",
            "جمحة"
        ],
        "جنيه": ["جنيح"],
        "جوز": [
            "جوذ",
            "جوظ",
            "جوس"
        ],
        "حاجة": [
            "هاجة",
            "عاجة"
        ],
        "حبيبتي": [
            "هبيبتي",
            "عبيبتي",
            "حبيبطي"
        ],
        "حبيبي": [
            "هبيبي",
            "عبيبي"
        ],
        "حداشر": [
            "هداشر",
            "عداشر",
            "حضاشر"
        ],
        "حران": [
            "هران",
            "عران"
        ],
        "حسب": [
            "هسب",
            "عسب",
            "حثب",
            "حزب",
            "حصب"
        ],
        "حسين": [
            "هسين",
            "عسين",
            "حثين",
            "حزين",
            "حصين"
        ],
        "حصان": [
            "هصان",
            "عصان",
            "حثان",
            "حسان"
        ],
        "حقوق": [
            "هقوق",
            "عقوق",
            "حكوق",
            "حءوق",
            "حقوك",
            "حقوء"
        ],
        "حلال": [
            "هلال",
            "علال"
        ],
        "حلو": ["هلو", "علو"],
        "حلول": [
            "هلول",
            "علول"
        ],
        "حمار": [
            "همار",
            "عمار"
        ],
        "حمير": [
            "همير",
            "عمير"
        ],
        "حيث": [
            "هيث",
            "عيث",
            "حيس",
            "حيص"
        ],
        "خروف": ["غروف"],
        "خس": [
            "غس",
            "خث",
            "خز",
            "خص"
        ],
        "خفاش": ["غفاش"],
        "خلاص": [
            "غلاص",
            "خلاث",
            "خلاس"
        ],
        "خمسة واربعين": [
            "غمسة واربعين",
            "خمثة واربعين",
            "خمزة واربعين",
            "خمصة واربعين",
            "خمسة واربأين",
            "خمسة واربحين"
        ],
        "خمسة وتسعين": [
            "غمسة وتسعين",
            "خمثة وتسعين",
            "خمزة وتسعين",
            "خمصة وتسعين",
            "خمسة وطسعين",
            "خمسة وتثعين",
            "خمسة وتزعين",
            "خمسة وتصعين",
            "خمسة وتسأين",
            "خمسة وتسحين"
        ],
        "خمسة وتلاتين": [
            "غمسة وتلاتين",
            "خمثة وتلاتين",
            "خمزة وتلاتين",
            "خمصة وتلاتين",
            "خمسة وطلاتين",
            "خمسة وتلاطين"
        ],
        "خمسة وتمانين": [
            "غمسة وتمانين",
            "خمثة وتمانين",
            "خمزة وتمانين",
            "خمصة وتمانين",
            "خمسة وطمانين"
        ],
        "خمسة وخمسين": [
            "غمسة وخمسين",
            "خمثة وخمسين",
            "خمزة وخمسين",
            "خمصة وخمسين",
            "خمسة وغمسين",
            "خمسة وخمثين",
            "خمسة وخمزين",
            "خمسة وخمصين"
        ],
        "خمسة وسبعين": [
            "غمسة وسبعين",
            "خمثة وسبعين",
            "خمزة وسبعين",
            "خمصة وسبعين",
            "خمسة وثبعين",
            "خمسة وزبعين",
            "خمسة وصبعين",
            "خمسة وسبأين",
            "خمسة وسبحين"
        ],
        "خمسة وستين": [
            "غمسة وستين",
            "خمثة وستين",
            "خمزة وستين",
            "خمصة وستين",
            "خمسة وثتين",
            "خمسة وزتين",
            "خمسة وصتين",
            "خمسة وسطين"
        ],
        "خمستاشر": [
            "غمستاشر",
            "خمثتاشر",
            "خمزتاشر",
            "خمصتاشر",
            "خمسطاشر"
        ],
        "خمسمية": [
            "غمسمية",
            "خمثمية",
            "خمزمية",
            "خمصمية"
        ],
        "خمسين": [
            "غمسين",
            "خمثين",
            "خمزين",
            "خمصين"
        ],
        "خوخ": ["غوخ", "خوغ"],
        "خيار": ["غيار"],
        "دا": ["ضا"],
        "دجاج": ["ضجاج"],
        "دراع": [
            "ضراع",
            "دراأ",
            "دراح"
        ],
        "دقيقة": [
            "ضقيقة",
            "دكيقة",
            "دءيقة",
            "دقيكة",
            "دقيءة"
        ],
        "دكان": [
            "ضكان",
            "دقان"
        ],
        "دلق": [
            "ضلق",
            "دلك",
            "دلء"
        ],
        "دمياط": [
            "ضمياط",
            "دميات"
        ],
        "دول": ["ضول"],
        "دولاب": ["ضولاب"],
        "دي": ["ضي"],
        "ذو القعدة": [
            "ظو القعدة",
            "زو القعدة",
            "ذو الكعدة",
            "ذو الءعدة",
            "ذو القأدة",
            "ذو القحدة",
            "ذو القعضة"
        ],
        "راجِع": [
            "راجِأ",
            "راجِح"
        ],
        "ربعمية": [
            "ربأمية",
            "ربحمية"
        ],
        "رجعت": [
            "رجأت",
            "رجحت",
            "رجعط"
        ],
        "رفيع": [
            "رفيأ",
            "رفيح"
        ],
        "رقية": [
            "ركية",
            "رءية"
        ],
        "رمضان صبحي": [
            "رمدان صبحي",
            "رمضان ثبحي",
            "رمضان سبحي",
            "رمضان صبهي",
            "رمضان صبعي"
        ],
        "رمضان": ["رمدان"],
        "روح": ["روه", "روع"],
        "رُجوع": [
            "رُجوأ",
            "رُجوح"
        ],
        "زبدة": [
            "ذبدة",
            "ظبدة",
            "سبدة",
            "زبضة"
        ],
        "زرافة": [
            "ذرافة",
            "ظرافة",
            "سرافة"
        ],
        "زعتر": [
            "ذعتر",
            "ظعتر",
            "سعتر",
            "زأتر",
            "زحتر",
            "زعطر"
        ],
        "زعلان": [
            "ذعلان",
            "ظعلان",
            "سعلان",
            "زألان",
            "زحلان"
        ],
        "زي": ["ذي", "ظي", "سي"],
        "زينب": [
            "ذينب",
            "ظينب",
            "سينب"
        ],
        "سارة": [
            "ثارة",
            "زارة",
            "صارة"
        ],
        "سبحة": [
            "ثبحة",
            "زبحة",
            "صبحة",
            "سبهة",
            "سبعة"
        ],
        "سبعة وتسعين": [
            "ثبعة وتسعين",
            "زبعة وتسعين",
            "صبعة وتسعين",
            "سبأة وتسعين",
            "سبحة وتسعين",
            "سبعة وطسعين",
            "سبعة وتثعين",
            "سبعة وتزعين",
            "سبعة وتصعين",
            "سبعة وتسأين",
            "سبعة وتسحين"
        ],
        "سبعة وتلاتين": [
            "ثبعة وتلاتين",
            "زبعة وتلاتين",
            "صبعة وتلاتين",
            "سبأة وتلاتين",
            "سبحة وتلاتين",
            "سبعة وطلاتين",
            "سبعة وتلاطين"
        ],
        "سبعة وتمانين": [
            "ثبعة وتمانين",
            "زبعة وتمانين",
            "صبعة وتمانين",
            "سبأة وتمانين",
            "سبحة وتمانين",
            "سبعة وطمانين"
        ],
        "سبعة وخمسين": [
            "ثبعة وخمسين",
            "زبعة وخمسين",
            "صبعة وخمسين",
            "سبأة وخمسين",
            "سبحة وخمسين",
            "سبعة وغمسين",
            "سبعة وخمثين",
            "سبعة وخمزين",
            "سبعة وخمصين"
        ],
        "سبعة وسبعين": [
            "ثبعة وسبعين",
            "زبعة وسبعين",
            "صبعة وسبعين",
            "سبأة وسبعين",
            "سبحة وسبعين",
            "سبعة وثبعين",
            "سبعة وزبعين",
            "سبعة وصبعين",
            "سبعة وسبأين",
            "سبعة وسبحين"
        ],
        "سبعة وستين": [
            "ثبعة وستين",
            "زبعة وستين",
            "صبعة وستين",
            "سبأة وستين",
            "سبحة وستين",
            "سبعة وثتين",
            "سبعة وزتين",
            "سبعة وصتين",
            "سبعة وسطين"
        ],
        "سبعة وعشرين": [
            "ثبعة وعشرين",
            "زبعة وعشرين",
            "صبعة وعشرين",
            "سبأة وعشرين",
            "سبحة وعشرين",
            "سبعة وأشرين",
            "سبعة وحشرين"
        ],
        "سبعتاشر": [
            "ثبعتاشر",
            "زبعتاشر",
            "صبعتاشر",
            "سبأتاشر",
            "سبحتاشر",
            "سبعطاشر"
        ],
        "سبعمية": [
            "ثبعمية",
            "زبعمية",
            "صبعمية",
            "سبأمية",
            "سبحمية"
        ],
        "سبعين": [
            "ثبعين",
            "زبعين",
            "صبعين",
            "سبأين",
            "سبحين"
        ],
        "ستة وتسعين": [
            "ثتة وتسعين",
            "زتة وتسعين",
            "صتة وتسعين",
            "سطة وتسعين",
            "ستة وطسعين",
            "ستة وتثعين",
            "ستة وتزعين",
            "ستة وتصعين",
            "ستة وتسأين",
            "ستة وتسحين"
        ],
        "ستة وتلاتين": [
            "ثتة وتلاتين",
            "زتة وتلاتين",
            "صتة وتلاتين",
            "سطة وتلاتين",
            "ستة وطلاتين",
            "ستة وتلاطين"
        ],
        "ستة وتمانين": [
            "ثتة وتمانين",
            "زتة وتمانين",
            "صتة وتمانين",
            "سطة وتمانين",
            "ستة وطمانين"
        ],
        "ستة وخمسين": [
            "ثتة وخمسين",
            "زتة وخمسين",
            "صتة وخمسين",
            "سطة وخمسين",
            "ستة وغمسين",
            "ستة وخمثين",
            "ستة وخمزين",
            "ستة وخمصين"
        ],
        "ستة وسبعين": [
            "ثتة وسبعين",
            "زتة وسبعين",
            "صتة وسبعين",
            "سطة وسبعين",
            "ستة وثبعين",
            "ستة وزبعين",
            "ستة وصبعين",
            "ستة وسبأين",
            "ستة وسبحين"
        ],
        "ستة وستين": [
            "ثتة وستين",
            "زتة وستين",
            "صتة وستين",
            "سطة وستين",
            "ستة وثتين",
            "ستة وزتين",
            "ستة وصتين",
            "ستة وسطين"
        ],
        "ستة وعشرين": [
            "ثتة وعشرين",
            "زتة وعشرين",
            "صتة وعشرين",
            "سطة وعشرين",
            "ستة وأشرين",
            "ستة وحشرين"
        ],
        "ستين": [
            "ثتين",
            "زتين",
            "صتين",
            "سطين"
        ],
        "سجاجيد": [
            "ثجاجيد",
            "زجاجيد",
            "صجاجيد",
            "سجاجيض"
        ],
        "سجادة": [
            "ثجادة",
            "زجادة",
            "صجادة",
            "سجاضة"
        ],
        "سجق": [
            "ثجق",
            "زجق",
            "صجق",
            "سجك",
            "سجء"
        ],
        "سلام عليكم": [
            "ثلام عليكم",
            "زلام عليكم",
            "صلام عليكم",
            "سلام أليكم",
            "سلام حليكم",
            "سلام عليقم"
        ],
        "سلام": [
            "ثلام",
            "زلام",
            "صلام"
        ],
        "سلحفاة": [
            "ثلحفاة",
            "زلحفاة",
            "صلحفاة",
            "سلهفاة",
            "سلعفاة"
        ],
        "سلطنة عمان": [
            "ثلطنة عمان",
            "زلطنة عمان",
            "صلطنة عمان",
            "سلتنة عمان",
            "سلطنة أمان",
            "سلطنة حمان"
        ],
        "سمكة": [
            "ثمكة",
            "زمكة",
            "صمكة",
            "سمقة"
        ],
        "سنة": [
            "ثنة",
            "زنة",
            "صنة"
        ],
        "سوريا": [
            "ثوريا",
            "زوريا",
            "صوريا"
        ],
        "سوق": [
            "ثوق",
            "زوق",
            "صوق",
            "سوك",
            "سوء"
        ],
        "سيف": [
            "ثيف",
            "زيف",
            "صيف"
        ],
        "سُك": [
            "ثُك",
            "زُك",
            "صُك",
            "سُق"
        ],
        "شباك": ["شباق"],
        "شبه": ["شبح"],
        "شرق": ["شرك", "شرء"],
        "شطرنج": ["شترنج"],
        "شغال": ["شخال"],
        "شنطة": ["شنتة"],
        "شهرزاد": [
            "شحرزاد",
            "شهرذاد",
            "شهرظاد",
            "شهرساد",
            "شهرزاض"
        ],
        "شيخ": ["شيغ"],
        "شَقِيّ": [
            "شَكِيّ",
            "شَءِيّ"
        ],
        "صباح الخير": [
            "ثباح الخير",
            "سباح الخير",
            "صباه الخير",
            "صباع الخير",
            "صباح الغير"
        ],
        "صباح النور": [
            "ثباح النور",
            "سباح النور",
            "صباه النور",
            "صباع النور"
        ],
        "صحرة": [
            "ثحرة",
            "سحرة",
            "صهرة",
            "صعرة"
        ],
        "صعب": [
            "ثعب",
            "سعب",
            "صأب",
            "صحب"
        ],
        "صغير": [
            "ثغير",
            "سغير",
            "صخير"
        ],
        "صندوق": [
            "ثندوق",
            "سندوق",
            "صنضوق",
            "صندوك",
            "صندوء"
        ],
        "صيدلية": [
            "ثيدلية",
            "سيدلية",
            "صيضلية"
        ],
        "ضفدع": [
            "دفدع",
            "ضفضع",
            "ضفدأ",
            "ضفدح"
        ],
        "ضيق": [
            "ديق",
            "ضيك",
            "ضيء"
        ],
        "طاسة": [
            "تاسة",
            "طاثة",
            "طازة",
            "طاصة"
        ],
        "طبخ": ["تبخ", "طبغ"],
        "طحن": [
            "تحن",
            "طهن",
            "طعن"
        ],
        "طعمها": [
            "تعمها",
            "طأمها",
            "طحمها",
            "طعمحا"
        ],
        "طماطم": [
            "تماطم",
            "طماتم"
        ],
        "طويل": ["تويل"],
        "عائشة": [
            "أائشة",
            "حائشة"
        ],
        "عادي": [
            "أادي",
            "حادي",
            "عاضي"
        ],
        "عامل ايه؟": [
            "أامل ايه؟",
            "حامل ايه؟",
            "عامل ايح؟"
        ],
        "عايزة": [
            "أايزة",
            "حايزة",
            "عايذة",
            "عايظة",
            "عايسة"
        ],
        "عايزك": [
            "أايزك",
            "حايزك",
            "عايذك",
            "عايظك",
            "عايسك",
            "عايزق"
        ],
        "عبد الرحمن": [
            "أبد الرحمن",
            "حبد الرحمن",
            "عبض الرحمن",
            "عبد الرهمن",
            "عبد الرعمن"
        ],
        "عبد الله": [
            "أبد الله",
            "حبد الله",
            "عبض الله",
            "عبد اللح"
        ],
        "عبيد (عِبيد)": [
            "أبيد (عِبيد)",
            "حبيد (عِبيد)",
            "عبيض (عِبيد)",
            "عبيد (أِبيد)",
            "عبيد (حِبيد)",
            "عبيد (عِبيض)"
        ],
        "عثمان": [
            "أثمان",
            "حثمان",
            "عسمان",
            "عصمان"
        ],
        "عربي": [
            "أربي",
            "حربي"
        ],
        "عرس": [
            "أرس",
            "حرس",
            "عرث",
            "عرز",
            "عرص"
        ],
        "عرف": ["أرف", "حرف"],
        "عسل": [
            "أسل",
            "حسل",
            "عثل",
            "عزل",
            "عصل"
        ],
        "عشا": ["أشا", "حشا"],
        "عشان": [
            "أشان",
            "حشان"
        ],
        "عظام (عِظام)": [
            "أظام (عِظام)",
            "حظام (عِظام)",
            "عذام (عِظام)",
            "عزام (عِظام)",
            "عظام (أِظام)",
            "عظام (حِظام)",
            "عظام (عِذام)",
            "عظام (عِزام)"
        ],
        "عقد": [
            "أقد",
            "حقد",
            "عكد",
            "عءد",
            "عقض"
        ],
        "علم": ["ألم", "حلم"],
        "على الأقل": [
            "ألى الأقل",
            "حلى الأقل",
            "على العقل",
            "على الأكل",
            "على الأءل"
        ],
        "على": ["ألى", "حلى"],
        "علي": ["ألي", "حلي"],
        "عمال": [
            "أمال",
            "حمال"
        ],
        "عمر": ["أمر", "حمر"],
        "عمرو": [
            "أمرو",
            "حمرو"
        ],
        "عنب": ["أنب", "حنب"],
        "عنوان": [
            "أنوان",
            "حنوان"
        ],
        "عيد الأضحى": [
            "أيد الأضحى",
            "حيد الأضحى",
            "عيض الأضحى",
            "عيد العضحى",
            "عيد الأدحى",
            "عيد الأضهى",
            "عيد الأضعى"
        ],
        "عيد الفطر": [
            "أيد الفطر",
            "حيد الفطر",
            "عيض الفطر",
            "عيد الفتر"
        ],
        "عيد ميلاد سعيد": [
            "أيد ميلاد سعيد",
            "حيد ميلاد سعيد",
            "عيض ميلاد سعيد",
            "عيد ميلاض سعيد",
            "عيد ميلاد ثعيد",
            "عيد ميلاد زعيد",
            "عيد ميلاد صعيد",
            "عيد ميلاد سأيد",
            "عيد ميلاد سحيد",
            "عيد ميلاد سعيض"
        ],
        "عيسى": [
            "أيسى",
            "حيسى",
            "عيثى",
            "عيزى",
            "عيصى"
        ],
        "عيش": ["أيش", "حيش"],
        "عين": ["أين", "حين"],
        "غادة": [
            "خادة",
            "غاضة"
        ],
        "غالي": ["خالي"],
        "غدا": ["خدا", "غضا"],
        "غراب": ["خراب"],
        "غرب": ["خرب"],
        "غزال": [
            "خزال",
            "غذال",
            "غظال",
            "غسال"
        ],
        "غزة": [
            "خزة",
            "غذة",
            "غظة",
            "غسة"
        ],
        "فاصوليا": [
            "فاثوليا",
            "فاسوليا"
        ],
        "فاطمة": ["فاتمة"],
        "فراخ": ["فراغ"],
        "فرح": ["فره", "فرع"],
        "فرخة": ["فرغة"],
        "فسطاط": [
            "فثطاط",
            "فزطاط",
            "فصطاط",
            "فستاط",
            "فسطات"
        ],
        "فلامنك": [
            "فلامنق"
        ],
        "فلسطين": [
            "فلثطين",
            "فلزطين",
            "فلصطين",
            "فلستين"
        ],
        "فندق": [
            "فنضق",
            "فندك",
            "فندء"
        ],
        "فنزويلا": [
            "فنذويلا",
            "فنظويلا",
            "فنسويلا"
        ],
        "فوق": ["فوك", "فوء"],
        "قبل": ["كبل", "ءبل"],
        "قدام": [
            "كدام",
            "ءدام",
            "قضام"
        ],
        "قرنفل": [
            "كرنفل",
            "ءرنفل"
        ],
        "قصير": [
            "كصير",
            "ءصير",
            "قثير",
            "قسير"
        ],
        "قط": ["كط", "ءط", "قت"],
        "قطار": [
            "كطار",
            "ءطار",
            "قتار"
        ],
        "قطة": [
            "كطة",
            "ءطة",
            "قتة"
        ],
        "قطر": [
            "كطر",
            "ءطر",
            "قتر"
        ],
        "قلب": ["كلب", "ءلب"],
        "قلم": ["كلم", "ءلم"],
        "قمر": ["كمر", "ءمر"],
        "قناة السويس": [
            "كناة السويس",
            "ءناة السويس",
            "قناة الثويس",
            "قناة الزويس",
            "قناة الصويس",
            "قناة السويث",
            "قناة السويز",
            "قناة السويص"
        ],
        "قهوة": [
            "كهوة",
            "ءهوة",
            "قحوة"
        ],
        "قوس قزح": [
            "كوس قزح",
            "ءوس قزح",
            "قوث قزح",
            "قوز قزح",
            "قوص قزح",
            "قوس كزح",
            "قوس ءزح",
            "قوس قذح",
            "قوس قظح",
            "قوس قسح",
            "قوس قزه",
            "قوس قزع"
        ],
        "كارديجان": [
            "قارديجان",
            "كارضيجان"
        ],
        "كبايات": [
            "قبايات",
            "كباياط"
        ],
        "كتاب": [
            "قتاب",
            "كطاب"
        ],
        "كتير": [
            "قتير",
            "كطير"
        ],
        "كدا": ["قدا", "كضا"],
        "كسكسي": [
            "قسكسي",
            "كثكسي",
            "كزكسي",
            "كصكسي",
            "كسقسي",
            "كسكثي",
            "كسكزي",
            "كسكصي"
        ],
        "كفتة": [
            "قفتة",
            "كفطة"
        ],
        "كل سنة وانت طيب": [
            "قل سنة وانت طيب",
            "كل ثنة وانت طيب",
            "كل زنة وانت طيب",
            "كل صنة وانت طيب",
            "كل سنة وانط طيب",
            "كل سنة وانت تيب"
        ],
        "كلب": ["قلب"],
        "كمترى": [
            "قمترى",
            "كمطرى"
        ],
        "كنافة": ["قنافة"],
        "كنبة": ["قنبة"],
        "كوبَّاية": [
            "قوبَّاية"
        ],
        "كورس": [
            "قورس",
            "كورث",
            "كورز",
            "كورص"
        ],
        "كوفية": ["قوفية"],
        "كويس": [
            "قويس",
            "كويث",
            "كويز",
            "كويص"
        ],
        "كيكة": [
            "قيكة",
            "كيقة"
        ],
        "لاحق": [
            "لاهق",
            "لاعق",
            "لاحك",
            "لاحء"
        ],
        "ليه": ["ليح"],
        "مالكش فيه": [
            "مالقش فيه",
            "مالكش فيح"
        ],
        "مالكيش فيه": [
            "مالقيش فيه",
            "مالكيش فيح"
        ],
        "متبقاش بطئ !": [
            "مطبقاش بطئ !",
            "متبكاش بطئ !",
            "متبءاش بطئ !",
            "متبقاش بتئ !"
        ],
        "متحف": [
            "مطحف",
            "متهف",
            "متعف"
        ],
        "متين": ["مطين"],
        "مثل": ["مسل", "مصل"],
        "محشي ورق عنب": [
            "مهشي ورق عنب",
            "معشي ورق عنب",
            "محشي ورك عنب",
            "محشي ورء عنب",
            "محشي ورق أنب",
            "محشي ورق حنب"
        ],
        "محشي": [
            "مهشي",
            "معشي"
        ],
        "محطة بنزين": [
            "مهطة بنزين",
            "معطة بنزين",
            "محتة بنزين",
            "محطة بنذين",
            "محطة بنظين",
            "محطة بنسين"
        ],
        "محفظة": [
            "مهفظة",
            "معفظة",
            "محفذة",
            "محفزة"
        ],
        "محل": ["مهل", "معل"],
        "محلات": [
            "مهلات",
            "معلات",
            "محلاط"
        ],
        "محمد الشناوي": [
            "مهمد الشناوي",
            "معمد الشناوي",
            "محمض الشناوي"
        ],
        "محمد صلاح": [
            "مهمد صلاح",
            "معمد صلاح",
            "محمض صلاح",
            "محمد ثلاح",
            "محمد سلاح",
            "محمد صلاه",
            "محمد صلاع"
        ],
        "محمد": [
            "مهمد",
            "معمد",
            "محمض"
        ],
        "مختلف": [
            "مغتلف",
            "مخطلف"
        ],
        "مخدة": [
            "مغدة",
            "مخضة"
        ],
        "مدرسة": [
            "مضرسة",
            "مدرثة",
            "مدرزة",
            "مدرصة"
        ],
        "مربع": [
            "مربأ",
            "مربح"
        ],
        "مزاج": [
            "مذاج",
            "مظاج",
            "مساج"
        ],
        "مستودع": [
            "مثتودع",
            "مزتودع",
            "مصتودع",
            "مسطودع",
            "مستوضع",
            "مستودأ",
            "مستودح"
        ],
        "مسجد": [
            "مثجد",
            "مزجد",
            "مصجد",
            "مسجض"
        ],
        "مسطرة": [
            "مثطرة",
            "مزطرة",
            "مصطرة",
            "مسترة"
        ],
        "مسمار": [
            "مثمار",
            "مزمار",
            "مصمار"
        ],
        "مصطفى": [
            "مثطفى",
            "مسطفى",
            "مصتفى"
        ],
        "مضاد حيوي": [
            "مداد حيوي",
            "مضاض حيوي",
            "مضاد هيوي",
            "مضاد عيوي"
        ],
        "مطبخ": [
            "متبخ",
            "مطبغ"
        ],
        "مظبوط": [
            "مذبوط",
            "مزبوط",
            "مظبوت"
        ],
        "معبد إدفو": [
            "مأبد إدفو",
            "محبد إدفو",
            "معبض إدفو",
            "معبد إضفو"
        ],
        "معبد الأقصر": [
            "مأبد الأقصر",
            "محبد الأقصر",
            "معبض الأقصر",
            "معبد العقصر",
            "معبد الأكصر",
            "معبد الأءصر",
            "معبد الأقثر",
            "معبد الأقسر"
        ],
        "معبد": [
            "مأبد",
            "محبد",
            "معبض"
        ],
        "معلم": [
            "مألم",
            "محلم"
        ],
        "معوض": [
            "مأوض",
            "محوض",
            "معود"
        ],
        "مفتاح": [
            "مفطاح",
            "مفتاه",
            "مفتاع"
        ],
        "ملوخية": [
            "ملوغية"
        ],
        "من فضلك": [
            "من فدلك",
            "من فضلق"
        ],
        "مناخ": ["مناغ"],
        "منتج": ["منطج"],
        "موز": [
            "موذ",
            "موظ",
            "موس"
        ],
        "موسم": [
            "موثم",
            "موزم",
            "موصم"
        ],
        "موظف": [
            "موذف",
            "موزف"
        ],
        "مَصر": [
            "مَثر",
            "مَسر"
        ],
        "مُتقدم": [
            "مُطقدم",
            "مُتكدم",
            "مُتءدم",
            "مُتقضم"
        ],
        "نسر": [
            "نثر",
            "نزر",
            "نصر"
        ],
        "نسكافيه": [
            "نثكافيه",
            "نزكافيه",
            "نصكافيه",
            "نسقافيه",
            "نسكافيح"
        ],
        "نعناع": [
            "نأناع",
            "نحناع",
            "نعناأ",
            "نعناح"
        ],
        "هادي": [
            "حادي",
            "هاضي"
        ],
        "هبوط": [
            "حبوط",
            "هبوت"
        ],
        "هرم": ["حرم"],
        "هزار": [
            "حزار",
            "هذار",
            "هظار",
            "هسار"
        ],
        "هندوراس": [
            "حندوراس",
            "هنضوراس",
            "هندوراث",
            "هندوراز",
            "هندوراص"
        ],
        "هنعمل ايه دلوقتي؟": [
            "حنعمل ايه دلوقتي؟",
            "هنأمل ايه دلوقتي؟",
            "هنحمل ايه دلوقتي؟",
            "هنعمل ايح دلوقتي؟",
            "هنعمل ايه ضلوقتي؟",
            "هنعمل ايه دلوكتي؟",
            "هنعمل ايه دلوءتي؟",
            "هنعمل ايه دلوقطي؟"
        ],
        "هو": ["حو"],
        "واحد واربعين": [
            "واهد واربعين",
            "واعد واربعين",
            "واحض واربعين",
            "واحد واربأين",
            "واحد واربحين"
        ],
        "واحد وتسعين": [
            "واهد وتسعين",
            "واعد وتسعين",
            "واحض وتسعين",
            "واحد وطسعين",
            "واحد وتثعين",
            "واحد وتزعين",
            "واحد وتصعين",
            "واحد وتسأين",
            "واحد وتسحين"
        ],
        "واحد وتمانين": [
            "واهد وتمانين",
            "واعد وتمانين",
            "واحض وتمانين",
            "واحد وطمانين"
        ],
        "واحد وسبعين": [
            "واهد وسبعين",
            "واعد وسبعين",
            "واحض وسبعين",
            "واحد وثبعين",
            "واحد وزبعين",
            "واحد وصبعين",
            "واحد وسبأين",
            "واحد وسبحين"
        ],
        "واحد وستين": [
            "واهد وستين",
            "واعد وستين",
            "واحض وستين",
            "واحد وثتين",
            "واحد وزتين",
            "واحد وصتين",
            "واحد وسطين"
        ],
        "واحد وعشرين": [
            "واهد وعشرين",
            "واعد وعشرين",
            "واحض وعشرين",
            "واحد وأشرين",
            "واحد وحشرين"
        ],
        "واحد": [
            "واهد",
            "واعد",
            "واحض"
        ],
        "وانت من أهل الخير": [
            "وانط من أهل الخير",
            "وانت من عهل الخير",
            "وانت من أحل الخير",
            "وانت من أهل الغير"
        ],
        "وحشتني": [
            "وهشتني",
            "وعشتني",
            "وحشطني"
        ],
        "وحشتيني": [
            "وهشتيني",
            "وعشتيني",
            "وحشطيني"
        ],
        "وسخ / وسخة": [
            "وثخ / وسخة",
            "وزخ / وسخة",
            "وصخ / وسخة",
            "وسغ / وسخة",
            "وسخ / وثخة",
            "وسخ / وزخة",
            "وسخ / وصخة",
            "وسخ / وسغة"
        ],
        "وسخ": [
            "وثخ",
            "وزخ",
            "وصخ",
            "وسغ"
        ],
        "وسط": [
            "وثط",
            "وزط",
            "وصط",
            "وست"
        ],
        "وطواط": [
            "وتواط",
            "وطوات"
        ],
        "وقت": [
            "وكت",
            "وءت",
            "وقط"
        ],
        "ولد": ["ولض"],
        "يا سلام": [
            "يا ثلام",
            "يا زلام",
            "يا صلام"
        ],
        "ياكل": ["ياقل"],
        "يجوع": [
            "يجوأ",
            "يجوح"
        ],
        "يخرس": [
            "يغرس",
            "يخرث",
            "يخرز",
            "يخرص"
        ],
        "يرحمك الله": [
            "يرهمك الله",
            "يرعمك الله",
            "يرحمق الله",
            "يرحمك اللح"
        ],
        "يسكت": [
            "يثكت",
            "يزكت",
            "يصكت",
            "يسقت",
            "يسكط"
        ],
        "يصحى": [
            "يثحى",
            "يسحى",
            "يصهى",
            "يصعى"
        ],
        "يضرب": ["يدرب"],
        "يقرا": [
            "يكرا",
            "يءرا"
        ],
        "يقفل": [
            "يكفل",
            "يءفل"
        ],
        "يقوم": [
            "يكوم",
            "يءوم"
        ],
        "يوسف": [
            "يوثف",
            "يوزف",
            "يوصف"
        ],
        "يونس": [
            "يونث",
            "يونز",
            "يونص"
        ]
    }

    random_item = get_random_item_from_dict(items)
    print("random_item: ", random_item[0])
    mp3_path = call_forvo(random_item[0])
    # mp3_path = ""

    spelling_alternatives = {
        random_item[0]: True
    }
    for i, alternative in enumerate(random_item[1]):
        spelling_alternatives[alternative] = False
        if i > 2:
            break

    return render_template('main.html', mp3_path=mp3_path, spelling_alternatives=spelling_alternatives)


def call_forvo(word='أبو سمبل'):
    key = os.environ.get('FORVO_KEY')
    url = f"https://apifree.forvo.com/key/{key}/format/json/action/word-pronunciations/word/{word}/language/arz"
    response = requests.get(url)

    # check if the response is successful
    if response.status_code == 200:
        # for every item in items, print pathmp3
        for item in response.json()["items"]:
            print(item["pathmp3"])
            return item["pathmp3"]
    else:
        # print the error
        print("Error: ", response.status_code)
        return ""

def get_random_item_from_dict(dict):
    return random.choice(list(dict.items()))